backend/load-tests/artillery.auth.yml
config:
  target: "{{ $processEnvironment.LOAD_BASE_URL || 'http://127.0.0.1:3001' }}"
  phases:
    - duration: 30
      arrivalRate: 10
    - duration: 30
      arrivalRate: 50
    - duration: 30
      arrivalRate: 100
    - duration: 30
      arrivalRate: 200
  defaults:
    headers:
      Authorization: "Bearer {{ $processEnvironment.LOAD_JWT_TOKEN }}"

scenarios:
  - name: auth-route
    flow:
      - get:
          url: "/api/tenant/usage"